{
      "Experiential Learning": "A hands-on approach to education where learners actively engage with their environment and learn through direct experience rather than through lecture or theory alone.",
      "Learning with Practitioners": "An educational approach where learners work directly with creative practitioners, artisans, community collaborators, activists, social workers and so on who are actively practicing in their field.",
      "Volunteering as Learning": "A pedagogical approach where learners contribute their time and skills to community projects or organisations while gaining practical experience and knowledge.",
      "Visual Learning": "An learning method that emphasizes the use of illustrations, photographs, videos, diagrams, and other visual media to enhance understanding and retention of learning outcomes.",
      "Material Learning": "A learning approach centered around physical interaction with materials to understand their properties, uses, and cultural significance.",
      "Critical Making": "A learning practice that combines critical thinking with hands-on making, encouraging learners to critically engage with the materials, processes, and contexts of creation.",
      "Cooking as Learning": "Using culinary arts and food preparation as an learning moment to explore cultural practices, dialogue with community collaborators, and gaining shared understanding.",
      "Learning with Materials": "An approach that emphasises using locally available materials as learning resources, connecting learning to the specific ecological and cultural contexts of a region.",
      "Self-directed Learning": "An educational approach where learners take initiative and responsibility for identifying their learning needs, setting goals, finding resources, and evaluating outcomes.",
      "Thesis": "A capstone project conducted in collaboration with an external organisation, allowing learners to apply their knowledge to real-world scenarios while receiving mentorship from industry partners.",
      "Walking": "A reflective learning practice involving structured walks through environments as a way to observe, document, and engage with surroundings as educational material.",
      "Talk Series": "Curated presentations by experts, practitioners, or community members designed to expose learners to diverse perspectives and specialized knowledge.",
      "Reflective": "Learning approaches that emphasize introspection and analysis of experiences to derive deeper understanding and meaning.",
      "Baithak": "A traditional South Asian format for communal learning and exchange, typically involving sitting together in a circle for discussion, storytelling, or artistic sharing.",
      "Public Engagement": "Educational activities that involve interaction with broader communities, encouraging learners to connect their studies with social contexts and public discourse.",
      "Apprenticeship": "A learning arrangement where a novice works closely with a master or expert to develop skills and knowledge through observation, guidance, and practice.",
      "Internship": "A structured work experience that allows learners to apply theoretical knowledge in professional settings while receiving supervision and mentorship.",
      "Primers": "Introductory modules lasting up to 4 weeks (24-60 NLH) that provide foundational knowledge and skills in a particular subject area. These modules accommodate up to 20 learners per cohort.",
      "Travelling Studio": "Immersive, location-based learning experiences lasting up to 3 weeks (36-108 NLH) that involve travel to different sites for on-the-ground exploration and study. Limited to 10 learners per cohort.",
      "Electives": "Optional modules lasting up to 4 weeks (24-60 NLH) that allow learners to explore specialized topics aligned with their interests. These modules accommodate up to 10 learners per cohort.",
      "Practicum": "Applied learning modules lasting up to 8 weeks (96-192 NLH) that focus on developing practical skills through hands-on projects and real-world applications. Limited to 10 learners per cohort.",
      "Core Pathways": "Comprehensive modules lasting up to 12 weeks (216-360 NLH) that provide in-depth exploration of central themes and methodologies within a concentration. Limited to 10 learners per cohort.",
      "Workshops": "Short, intensive learning experiences lasting up to 2 weeks (15-30 NLH) that focus on specific skills or techniques. These modules accommodate up to 20 learners per cohort.",
      "Make-a-thon": "Collaborative, project-based learning events lasting up to 1 week (18-30 NLH) where learners work in teams to develop solutions to specific challenges. These events accommodate up to 20 participants.",
      "Nodal Centres": "Regional learning facilities located in HK region, Channapatna, Kundapura, and Bangalore, serving as hubs for educational activities and community engagement.",
      "School of Concentrations": "Specialized areas of study that organize curriculum around particular themes, methodologies, or disciplines.",
      "Facilitators/Mentors": "Educators who guide learning processes, provide expertise, and support learners in their educational journey rather than delivering traditional instruction.",
      "NLH": "A measure of the estimated time a typical learner might take to complete all learning activities within a module, including contact hours, self-study, projects, and assessments.",
      "Cohort": "A group of learners who progress through a learning module or programme together, fostering community and collaborative learning.",
      "Open Call": "A public invitation for applications to join learning programmes, typically promoted through social media and other outreach channels.",
      "MOU": "Formal agreements with partner organisations such as NGMA, Gulbarga, and Folklore University that outline collaborative educational initiatives.",
      "Public Pedagogy": "Educational approaches that extend beyond traditional classroom settings to engage with broader communities and public spaces as sites of learning.",
      "Place-based Learning": "An educational approach that connects learning to local environments, communities, and contexts, emphasizing the unique characteristics and knowledge systems of specific places.",
      "Situated Knowledge": "Understanding that knowledge is not abstract or universal but is situated within particular historical, social, cultural, and geographical contexts.",
      "Co-learning": "A collaborative approach where facilitators and learners learn together, breaking down traditional hierarchies and recognizing the value of diverse knowledge sources.",
      "Micro-context": "A specific, localized setting or situation that provides rich opportunities for situated learning and exploration of the interrelationships between people, practices, and places.",
      "Lived Experiences": "The personal, subjective experiences of individuals that shape their understanding of the world and serve as valuable sources of knowledge in learning contexts.",
      "Axioms": "Foundational principles or values that guide educational approaches and serve as anchors for course development and learning experiences.",
      "Trimester": "A calendar structure dividing the academic year into three terms, allowing for flexible scheduling of modules and responsive integration with ongoing community engagement work.A calendar structure dividing the academic year into three terms, allowing for flexible scheduling of modules and responsive integration with ongoing community engagement work.",
      "Learning Infrastructure": "The physical, digital, and social resources that support the learning process, including spaces, tools, technologies, and community networks.The physical, digital, and social resources that support the learning process, including spaces, tools, technologies, and community networks.",
      "Session Plan": "A detailed outline of learning activities, materials, and objectives for each meeting or class period within a module.A detailed outline of learning activities, materials, and objectives for each meeting or class period within a module.",
      "Learning Outcomes": "Specific, measurable statements describing what learners should know, understand, or be able to do by the end of a learning experience.Specific, measurable statements describing what learners should know, understand, or be able to do by the end of a learning experience.",
      "Unit Plan": "The organized framework that outlines the sequence of topics, activities, and assessments within a learning module. The organized framework that outlines the sequence of topics, activities, and assessments within a learning module.",
      "Abstract": "A concise summary of a course that explains its focus, relevance, and value to potential learners.A concise summary of a course that explains its focus, relevance, and value to potential learners.",
      "Learning Materials": "Resources, texts, tools, and media used to support the learning process and achieve intended outcomes.Resources, texts, tools, and media used to support the learning process and achieve intended outcomes.",
      "Discovery": "The initial phase of a learner's journey where they explore available courses and learning opportunities.The initial phase of a learner's journey where they explore available courses and learning opportunities.",
      "Scoping": "The phase where learners evaluate time commitments, costs, and planning horizons for potential courses.The phase where learners evaluate time commitments, costs, and planning horizons for potential courses.",
      "Admission": "The process of applying for, being accepted into, and enrolling in a learning module or programme.The process of applying for, being accepted into, and enrolling in a learning module or programme.",
      "Onboarding": "The orientation phase that prepares learners for their educational experience by providing necessary information and resources.The orientation phase that prepares learners for their educational experience by providing necessary information and resources.",
      "Coursework": "The learning activities, assessments, and materials that comprise the core educational experience.The learning activities, assessments, and materials that comprise the core educational experience.",
      "Assessment Rubric": "A tool that articulates expectations for assignments by listing criteria and describing levels of quality from excellent to poor.A tool that articulates expectations for assignments by listing criteria and describing levels of quality from excellent to poor."
    }
